{
  "title": "Machine Learning Engineer",
  "description": "About the job\n\nBlackStone eIT, a leading computer software company, is seeking a talented and experienced Machine Learning Engineer to join our dynamic team. As a Machine Learning Engineer at BlackStone eIT, you will be responsible for designing, developing, and deploying cutting-edge machine learning models and algorithms. You will collaborate closely with cross-functional teams to analyze data, identify opportunities for applying machine learning techniques, and implement solutions to solve co...",
  "full_description": "About the job\n\nBlackStone eIT, a leading computer software company, is seeking a talented and experienced Machine Learning Engineer to join our dynamic team. As a Machine Learning Engineer at BlackStone eIT, you will be responsible for designing, developing, and deploying cutting-edge machine learning models and algorithms. You will collaborate closely with cross-functional teams to analyze data, identify opportunities for applying machine learning techniques, and implement solutions to solve complex business problems.\n\nIn this role, you will have the opportunity to work on a wide range of projects, spanning various industries, and make a significant impact on the company's success. We are looking for individuals who are passionate about machine learning and possess strong analytical and problem-solving skills.\n\nResponsibilities\n\n\nStudy and transform data science prototypes\nResearch and implement appropriate ML algorithms and tools\nDevelop machine learning applications according to requirements\nSelect appropriate datasets and data representation methods\nRun machine learning tests and experiments\nDeploy the trained models and build REST APIs\nPerform statistical analysis and fine-tuning using test results\nTrain and retrain systems when necessary\nExtend existing ML libraries and frameworks\nKeep abreast of developments in the field\n\n\nRequirements\n\n\nExperience: 2-3 years\nProven experience as a Machine Learning Engineer or similar role\nUnderstanding of data structures, data modeling and software architecture\nDeep knowledge of math, probability, statistics and algorithms\nAbility to write robust code in Python \nOutstanding analytical and problem-solving skills\nFamiliarity with machine learning frameworks (like Tensorflow or PyTorch) and libraries (like scikit-learn)\nExcellent communication skills\nAbility to work in a team\nBSc in Computer Science, Mathematics or a similar field; a Master's degree is a plus",
  "poster": "Cairo University logo",
  "company": "BlackStone eIT",
  "url": "https://www.linkedin.com/jobs/collections/recommended/?currentJobId=4281484347"
}